<template>
  <section>
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
    谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。谢邀！我是这么理解问题的，题主父级元素设置position：relative作为参照物，子元素设置position：absolute作绝对定位，然后目标是希望父元素高度可以自适应子元素。所以：子元素绝对定位，父级元素不能适应子级绝对定位元素的高度；但是可以通过设置min-height属性，设置最小高度，这样父元素不会比绝对定位元素小，又能适应多出来的高度，基本就能解决问题了。

    作者：李晓舟
    链接：https://www.zhihu.com/question/61914400/answer/192449980
    来源：知乎
    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。





  </section>
</template>
<script>

</script>
<style scoped lang="scss">

</style>
